In [1]:
pip install pandas

Requirement already satisfied: pandas in /Users/gim-yongbeom/opt/anaconda3/lib/python3.8/site-packages (1.2.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/gim-yongbeom/opt/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: pytz>=2017.3 in /Users/gim-yongbeom/opt/anaconda3/lib/python3.8/site-packages (from pandas) (2021.1)
Requirement already satisfied: numpy>=1.16.5 in /Users/gim-yongbeom/opt/anaconda3/lib/python3.8/site-packages (from pandas) (1.20.1)
Requirement already satisfied: six>=1.5 in /Users/gim-yongbeom/opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd
pd.Series([7,4,5,8])

0    7
1    4
2    5
3    8
dtype: int64

In [5]:
x = pd.Series([7,3,5,8], index=['서울','대구','부산','광주'])
print(x)

서울    7
대구    3
부산    5
광주    8
dtype: int64

In [6]:
x['서울']

7

In [8]:
x[['서울','부산']]

서울    7
부산    5
dtype: int64

In [9]:
x[['서울','부산','대구']]

서울    7
부산    5
대구    3
dtype: int64

In [10]:
x.index

Index(['서울', '대구', '부산', '광주'], dtype='object')

In [11]:
x.values

array([7, 3, 5, 8])

In [13]:
print(sorted(x.index))
print(sorted(x.values))

['광주', '대구', '부산', '서울']
[3, 5, 7, 8]

In [14]:
x.reindex(sorted(x.index)) # 
x

서울    7
대구    3
부산    5
광주    8
dtype: int64

In [16]:
x = pd.Series([3,8,5,4], index=['서울','대구','부산','광주'])
y = pd.Series([2,4,5,1], index=['대구','부산','서울','대전'])
x+y

광주     NaN
대구    10.0
대전     NaN
부산     9.0
서울     8.0
dtype: float64

In [18]:
x = pd.Series([3,8,5,4,5], index=['A','B','G','F','E'])
y = pd.Series([2,4,5,1,9], index=['Z','A','B','X','E'])
x+y

A     7.0
B    13.0
E    14.0
F     NaN
G     NaN
X     NaN
Z     NaN
dtype: float64

In [19]:
medal=[1,3,2,4,2,3] # 중복값 제거
x = pd.Series(medal)
print(pd.unique(x))

[1 3 2 4]

In [20]:
medal=['민준','현우','서연','동현','서연','현우']
x = pd.Series(medal)
print(pd.unique(x))

['민준' '현우' '서연' '동현']

In [23]:
age = {'민준':23,'현우':43,'서연':12,'동현':45,'현우':33}
x = pd.Series(age)

In [32]:
names = ['민준','현우','서연','동현','서연','현우','수빈']
x = pd.Series(names)

In [34]:
a = x[3:6]
print(a.values)

['동현' '서연' '현우']

In [43]:
data = {'age':[23,43,12,45],
        'name':['민준','현우','서연','동현'],
        'height':[175.3,180.3,165.8,172.7]
       }
x = pd.DataFrame(data,columns = ['name','age','height'])
x

  name  age  height
0   민준   23   175.3
1   현우   43   180.3
2   서연   12   165.8
3   동현   45   172.7

In [44]:
data = {'age':[23,43,12,45],
        'name':['민준','현우','서연','동현'],
        'height':[175.3,180.3,165.8,172.7]
       }
x = pd.DataFrame(data,columns = ['name','age','height'])
x.style.hide_index() # 인덱스 제거

In [46]:
x[['name','age']]

  name  age
0   민준   23
1   현우   43
2   서연   12
3   동현   45

In [38]:
x.name

0    민준
1    현우
2    서연
3    동현
Name: name, dtype: object

In [47]:
ary = [[1,2],[3,4],[5,6]]
data = pd.DataFrame(ary,columns=['Frist','Second'])
data

   Frist  Second
0      1       2
1      3       4
2      5       6

In [49]:
x.iloc[1] # 1번 행의 값들 출력

name         현우
age          43
height    180.3
Name: 1, dtype: object

In [50]:
data.iloc[1]

Frist     3
Second    4
Name: 1, dtype: int64

In [51]:
data.iloc[:,-1]

0    2
1    4
2    6
Name: Second, dtype: int64

In [52]:
data.iloc[:]

   Frist  Second
0      1       2
1      3       4
2      5       6

In [53]:
data.iloc[1][1]

4

In [54]:
data.iloc[:1,1]

0    2
Name: Second, dtype: int64

In [55]:
data.iloc[0:3:2]

   Frist  Second
0      1       2
2      5       6

In [59]:
ary = [[1,2],[3,4],[5,6],[7,8],[9,10]]
data = pd.DataFrame(ary,columns=['First','Second'])

In [60]:
data.head(3)

   First  Second
0      1       2
1      3       4
2      5       6

In [61]:
data.head() # 아무것도 안넣어주면 5개까지 나옴

   First  Second
0      1       2
1      3       4
2      5       6
3      7       8
4      9      10

In [62]:
data.head(8)

   First  Second
0      1       2
1      3       4
2      5       6
3      7       8
4      9      10

In [63]:
data.tail(3) # 마지막부터

   First  Second
2      5       6
3      7       8
4      9      10

In [64]:
data.tail()

   First  Second
0      1       2
1      3       4
2      5       6
3      7       8
4      9      10

In [65]:
data.tail(1)

   First  Second
4      9      10

In [66]:
data.tail(0)

Empty DataFrame
Columns: [First, Second]
Index: []

In [71]:
bools = [False,True,True,False,True]
data[bools] # True 인 부분만 출력

   First  Second
1      3       4
2      5       6
4      9      10

In [72]:
bools = [False,True,True,False,True]
data.Second[bools] # True 인 부분만 출력

1     4
2     6
4    10
Name: Second, dtype: int64

In [73]:
ary = [[1,2],[3,4],[5,6],[7,8],[9,10]]
data = pd.DataFrame(ary,columns=['수온','상온'])
data

   수온  상온
0   1   2
1   3   4
2   5   6
3   7   8
4   9  10

In [74]:
data['수온'] = data['수온'].astype('float')
data

    수온  상온
0  1.0   2
1  3.0   4
2  5.0   6
3  7.0   8
4  9.0  10

In [75]:
food = pd.read_csv('./datafile/food.csv')
food.head()

,Series_reference,Period,Data_value,STATUS,UNITS,Subject,Group,Series_title_1
0,CPIM.SE9S01,1999.06,645,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
1,CPIM.SE9S01,1999.07,647,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
2,CPIM.SE9S01,1999.08,645,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
3,CPIM.SE9S01,1999.09,644,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted
4,CPIM.SE9S01,1999.10,641,REVISED,Index,Consumers Price Index - CPI,"Food Price Index for New Zealand, Seasonally a...",Seasonally adjusted

In [76]:
# 한글 인코딩 옵션 : utf-8, cp949, euc-kr

In [77]:
accident = pd.read_csv('./datafile/acci.csv')
accident

               �������� �־�  �߻��Ǽ�  ����ڼ�  �λ��ڼ�    �߻�    ���  �λ�Ű�
0                  ����  ��     159      34     334    140    178     16
1                  ����  ��     218      73     348    200    139      9
2    ������ ������ ����  ��    8817      82   14031   3915   9530    586
3    ������ ������ ����  ��    5904      29    9728   2401   6884    443
4                   ��Ÿ  ��    9388     141   14070   4271   9217    582
5                   ��Ÿ  ��    6073      56    9218   2348   6457    413
6    ������ ��ȣ�ǹ� ����  ��    3772      80    3914   2063   1729    122
7    ������ ��ȣ�ǹ� ����  ��    3334      94    3535   1802   1626    107
8               ��ȣ����  ��   12552     210   20396   6816  12765    815
9               ��ȣ����  ��   12755     179   21724   7177  13749    798
10        �����Ÿ� ��Ȯ��  ��   12408      57   22392   4509  16882   1001
11        �����Ÿ� ��Ȯ��  ��    9867      40   17422   3025  13644    753
12  �������� �ǹ� ������  ��   62608    1740   91076  28081  58472   4523
13  �������� �ǹ� ������  ��   62783    2132   92942  26451  62209   4282
14             �߾Ӽ� ħ��  ��    6825     243   12427   4658   7339    430
15             �߾Ӽ� ħ��  ��    6193     202   11008   3846   6770    392

In [78]:
accident = pd.read_csv('./datafile/acci.csv', encoding='cp949')
accident

           법규위반 주야   발생건수  사망자수   부상자수     중상     경상  부상신고
0            과속  주    159    34    334    140    178    16
1            과속  야    218    73    348    200    139     9
2   교차로 통행방법 위반  주   8817    82  14031   3915   9530   586
3   교차로 통행방법 위반  야   5904    29   9728   2401   6884   443
4            기타  주   9388   141  14070   4271   9217   582
5            기타  야   6073    56   9218   2348   6457   413
6   보행자 보호의무 위반  주   3772    80   3914   2063   1729   122
7   보행자 보호의무 위반  야   3334    94   3535   1802   1626   107
8          신호위반  주  12552   210  20396   6816  12765   815
9          신호위반  야  12755   179  21724   7177  13749   798
10     안전거리 미확보  주  12408    57  22392   4509  16882  1001
11     안전거리 미확보  야   9867    40  17422   3025  13644   753
12  안전운전 의무 불이행  주  62608  1740  91076  28081  58472  4523
13  안전운전 의무 불이행  야  62783  2132  92942  26451  62209  4282
14       중앙선 침범  주   6825   243  12427   4658   7339   430
15       중앙선 침범  야   6193   202  11008   3846   6770   392